experiments/results/baseline-jaeger/raw/20260623_223847_compose-post_R500_t4_c40_d60.txt
# workload=compose-post
# rate=500
# threads=4
# connections=40
# duration=60
# timestamp=20260623_223847

Running 1m test @ http://localhost:8080/wrk2-api/post/compose
  4 threads and 40 connections

  Thread calibration: mean lat.: 4.842ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 4.883ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 4.775ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 4.908ms, rate sampling interval: 13ms

-----------------------------------------------------------------------
Test Results @ http://localhost:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     3.93ms    1.01ms   7.58ms   79.08%
    Req/Sec   129.77    105.62   416.00     59.59%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.70ms
 75.000%    4.34ms
 90.000%    5.14ms
 99.000%    7.58ms
 99.900%   10.53ms
 99.990%   13.02ms
 99.999%   13.77ms
100.000%   13.77ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.417     0.000000            1         1.00
       2.963     0.100000         2503         1.11
       3.161     0.200000         5013         1.25
       3.335     0.300000         7515         1.43
       3.507     0.400000        10003         1.67
       3.697     0.500000        12491         2.00
       3.797     0.550000        13742         2.22
       3.911     0.600000        14996         2.50
       4.035     0.650000        16231         2.86
       4.179     0.700000        17503         3.33
       4.343     0.750000        18741         4.00
       4.439     0.775000        19359         4.44
       4.539     0.800000        19984         5.00
       4.659     0.825000        20625         5.71
       4.791     0.850000        21230         6.67
       4.955     0.875000        21851         8.00
       5.039     0.887500        22166         8.89
       5.139     0.900000        22478        10.00
       5.267     0.912500        22789        11.43
       5.407     0.925000        23098        13.33
       5.579     0.937500        23411        16.00
       5.687     0.943750        23564        17.78
       5.799     0.950000        23720        20.00
       5.935     0.956250        23875        22.86
       6.087     0.962500        24030        26.67
       6.291     0.968750        24186        32.00
       6.411     0.971875        24265        35.56
       6.531     0.975000        24344        40.00
       6.671     0.978125        24419        45.71
       6.851     0.981250        24498        53.33
       7.051     0.984375        24576        64.00
       7.179     0.985938        24614        71.11
       7.311     0.987500        24654        80.00
       7.491     0.989062        24694        91.43
       7.663     0.990625        24732       106.67
       7.859     0.992188        24770       128.00
       7.979     0.992969        24790       142.22
       8.119     0.993750        24809       160.00
       8.271     0.994531        24829       182.86
       8.479     0.995313        24848       213.33
       8.735     0.996094        24868       256.00
       8.839     0.996484        24878       284.44
       8.959     0.996875        24887       320.00
       9.167     0.997266        24898       365.71
       9.351     0.997656        24907       426.67
       9.591     0.998047        24918       512.00
       9.671     0.998242        24922       568.89
       9.799     0.998437        24926       640.00
       9.927     0.998633        24931       731.43
      10.079     0.998828        24936       853.33
      10.567     0.999023        24941      1024.00
      10.791     0.999121        24944      1137.78
      10.855     0.999219        24946      1280.00
      10.991     0.999316        24948      1462.86
      11.167     0.999414        24951      1706.67
      11.391     0.999512        24954      2048.00
      11.471     0.999561        24955      2275.56
      11.591     0.999609        24956      2560.00
      11.679     0.999658        24957      2925.71
      11.999     0.999707        24958      3413.33
      12.087     0.999756        24959      4096.00
      12.175     0.999780        24960      4551.11
      12.391     0.999805        24961      5120.00
      12.391     0.999829        24961      5851.43
      12.703     0.999854        24962      6826.67
      12.703     0.999878        24962      8192.00
      13.023     0.999890        24963      9102.22
      13.023     0.999902        24963     10240.00
      13.023     0.999915        24963     11702.86
      13.303     0.999927        24964     13653.33
      13.303     0.999939        24964     16384.00
      13.303     0.999945        24964     18204.44
      13.303     0.999951        24964     20480.00
      13.303     0.999957        24964     23405.71
      13.775     0.999963        24965     27306.67
      13.775     1.000000        24965          inf
#[Mean    =        3.930, StdDeviation   =        1.005]
#[Max     =       13.768, Total count    =        24965]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  29948 requests in 1.00m, 6.14MB read
Requests/sec:    499.04  
Transfer/sec:    104.78KB

# docker compose ps
NAME                                     IMAGE                                                COMMAND                  SERVICE                  CREATED        STATUS             PORTS
socialnetwork-compose-post-service-1     deathstarbench/social-network-microservices:latest   "ComposePostService"     compose-post-service     11 hours ago   Up About an hour   
socialnetwork-home-timeline-redis-1      redis                                                "docker-entrypoint.s…"   home-timeline-redis      11 hours ago   Up About an hour   6379/tcp
socialnetwork-home-timeline-service-1    deathstarbench/social-network-microservices:latest   "HomeTimelineService"    home-timeline-service    11 hours ago   Up About an hour   
socialnetwork-jaeger-agent-1             jaegertracing/all-in-one:1.62.0                      "/go/bin/all-in-one-…"   jaeger-agent             11 hours ago   Up About an hour   4317-4318/tcp, 5775/udp, 5778/tcp, 9411/tcp, 14250/tcp, 14268/tcp, 6831-6832/udp, 0.0.0.0:16686->16686/tcp, [::]:16686->16686/tcp
socialnetwork-media-frontend-1           yg397/media-frontend:xenial                          "/usr/local/openrest…"   media-frontend           11 hours ago   Up About an hour   0.0.0.0:8081->8080/tcp, [::]:8081->8080/tcp
socialnetwork-media-memcached-1          memcached                                            "docker-entrypoint.s…"   media-memcached          11 hours ago   Up About an hour   11211/tcp
socialnetwork-media-mongodb-1            mongo:4.4.6                                          "docker-entrypoint.s…"   media-mongodb            11 hours ago   Up About an hour   27017/tcp
socialnetwork-media-service-1            deathstarbench/social-network-microservices:latest   "MediaService"           media-service            11 hours ago   Up About an hour   
socialnetwork-nginx-thrift-1             yg397/openresty-thrift:xenial                        "/usr/local/openrest…"   nginx-thrift             11 hours ago   Up About an hour   0.0.0.0:8080->8080/tcp, [::]:8080->8080/tcp
socialnetwork-post-storage-memcached-1   memcached                                            "docker-entrypoint.s…"   post-storage-memcached   11 hours ago   Up About an hour   11211/tcp
socialnetwork-post-storage-mongodb-1     mongo:4.4.6                                          "docker-entrypoint.s…"   post-storage-mongodb     11 hours ago   Up About an hour   27017/tcp
socialnetwork-post-storage-service-1     deathstarbench/social-network-microservices:latest   "PostStorageService"     post-storage-service     11 hours ago   Up About an hour   0.0.0.0:10002->9090/tcp, [::]:10002->9090/tcp
socialnetwork-social-graph-mongodb-1     mongo:4.4.6                                          "docker-entrypoint.s…"   social-graph-mongodb     11 hours ago   Up About an hour   27017/tcp
socialnetwork-social-graph-redis-1       redis                                                "docker-entrypoint.s…"   social-graph-redis       11 hours ago   Up About an hour   6379/tcp
socialnetwork-social-graph-service-1     deathstarbench/social-network-microservices:latest   "SocialGraphService"     social-graph-service     11 hours ago   Up About an hour   
socialnetwork-text-service-1             deathstarbench/social-network-microservices:latest   "TextService"            text-service             11 hours ago   Up About an hour   
socialnetwork-unique-id-service-1        deathstarbench/social-network-microservices:latest   "UniqueIdService"        unique-id-service        11 hours ago   Up About an hour   
socialnetwork-url-shorten-memcached-1    memcached                                            "docker-entrypoint.s…"   url-shorten-memcached    11 hours ago   Up About an hour   11211/tcp
socialnetwork-url-shorten-mongodb-1      mongo:4.4.6                                          "docker-entrypoint.s…"   url-shorten-mongodb      11 hours ago   Up About an hour   27017/tcp
socialnetwork-url-shorten-service-1      deathstarbench/social-network-microservices:latest   "UrlShortenService"      url-shorten-service      11 hours ago   Up About an hour   
socialnetwork-user-memcached-1           memcached                                            "docker-entrypoint.s…"   user-memcached           11 hours ago   Up About an hour   11211/tcp
socialnetwork-user-mention-service-1     deathstarbench/social-network-microservices:latest   "UserMentionService"     user-mention-service     11 hours ago   Up About an hour   
socialnetwork-user-mongodb-1             mongo:4.4.6                                          "docker-entrypoint.s…"   user-mongodb             11 hours ago   Up About an hour   27017/tcp
socialnetwork-user-service-1             deathstarbench/social-network-microservices:latest   "UserService"            user-service             11 hours ago   Up About an hour   
socialnetwork-user-timeline-mongodb-1    mongo:4.4.6                                          "docker-entrypoint.s…"   user-timeline-mongodb    11 hours ago   Up About an hour   27017/tcp
socialnetwork-user-timeline-redis-1      redis                                                "docker-entrypoint.s…"   user-timeline-redis      11 hours ago   Up About an hour   6379/tcp
socialnetwork-user-timeline-service-1    deathstarbench/social-network-microservices:latest   "UserTimelineService"    user-timeline-service    11 hours ago   Up About an hour